---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceAlbedo
source: html/8a857208-f65c-10c7-afbc-9ea1ec2d1f24.htm
---
# Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceAlbedo Property

The property labeled "Color" from the "AdvancedTransparent" schema.

## Syntax (C#)
```csharp
public static string SurfaceAlbedo { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.